{"modelTopology": {"versions": {}, "node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "op": "Placeholder", "name": "input"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "output/y"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "output/Minimum/y"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_5/bias_value"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_5/conv2d_filter"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_4/bias_value"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_4/conv2d_filter"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_3/bias_value"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_3/conv2d_filter"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_2/bias_value"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_2/conv2d_filter"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_1/bias_value"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_1/conv2d_filter"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "16"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_0/bias_value"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "conv2d_bias_0/conv2d_filter"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const", "name": "upconv/conv2d_transpose_filter"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "op": "Const", "name": "upconv/conv2d_transpose/output_shape/3"}, {"attr": {"value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "op": "Const", "name": "upconv/mul/y"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "op": "Const", "name": "upconv/strided_slice/stack_1"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "op": "Const", "name": "upconv/strided_slice_2/stack_1"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "op": "Const", "name": "upconv/strided_slice_1/stack_1"}, {"attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}, "dtype": {"type": "DT_INT32"}}, "op": "Const", "name": "upconv/strided_slice/stack"}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}, "op": "Conv2D", "name": "conv2d_bias_0/conv2d", "input": ["input", "conv2d_bias_0/conv2d_filter"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "op": "BiasAdd", "name": "conv2d_bias_0/bias_add", "input": ["conv2d_bias_0/conv2d", "conv2d_bias_0/bias_value"]}, {"attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_0", "input": ["conv2d_bias_0/bias_add"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}, "op": "Conv2D", "name": "conv2d_bias_1/conv2d", "input": ["leaky_relu_0", "conv2d_bias_1/conv2d_filter"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "op": "BiasAdd", "name": "conv2d_bias_1/bias_add", "input": ["conv2d_bias_1/conv2d", "conv2d_bias_1/bias_value"]}, {"attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_1", "input": ["conv2d_bias_1/bias_add"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}, "op": "Conv2D", "name": "conv2d_bias_2/conv2d", "input": ["leaky_relu_1", "conv2d_bias_2/conv2d_filter"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "op": "BiasAdd", "name": "conv2d_bias_2/bias_add", "input": ["conv2d_bias_2/conv2d", "conv2d_bias_2/bias_value"]}, {"attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_2", "input": ["conv2d_bias_2/bias_add"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}, "op": "Conv2D", "name": "conv2d_bias_3/conv2d", "input": ["leaky_relu_2", "conv2d_bias_3/conv2d_filter"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "op": "BiasAdd", "name": "conv2d_bias_3/bias_add", "input": ["conv2d_bias_3/conv2d", "conv2d_bias_3/bias_value"]}, {"attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_3", "input": ["conv2d_bias_3/bias_add"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}, "op": "Conv2D", "name": "conv2d_bias_4/conv2d", "input": ["leaky_relu_3", "conv2d_bias_4/conv2d_filter"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "op": "BiasAdd", "name": "conv2d_bias_4/bias_add", "input": ["conv2d_bias_4/conv2d", "conv2d_bias_4/bias_value"]}, {"attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_4", "input": ["conv2d_bias_4/bias_add"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}, "op": "Conv2D", "name": "conv2d_bias_5/conv2d", "input": ["leaky_relu_4", "conv2d_bias_5/conv2d_filter"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}, "op": "BiasAdd", "name": "conv2d_bias_5/bias_add", "input": ["conv2d_bias_5/conv2d", "conv2d_bias_5/bias_value"]}, {"attr": {"alpha": {"f": 0.10000000149011612}, "T": {"type": "DT_FLOAT"}}, "op": "LeakyRelu", "name": "leaky_relu_5", "input": ["conv2d_bias_5/bias_add"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "op": "Shape", "name": "upconv/Shape", "input": ["leaky_relu_5"]}, {"attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}, "op": "StridedSlice", "name": "upconv/strided_slice_2", "input": ["upconv/Shape", "upconv/strided_slice_1/stack_1", "upconv/strided_slice_2/stack_1", "upconv/strided_slice/stack_1"]}, {"attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}, "op": "StridedSlice", "name": "upconv/strided_slice_1", "input": ["upconv/Shape", "upconv/strided_slice/stack_1", "upconv/strided_slice_1/stack_1", "upconv/strided_slice/stack_1"]}, {"attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}, "op": "StridedSlice", "name": "upconv/strided_slice", "input": ["upconv/Shape", "upconv/strided_slice/stack", "upconv/strided_slice/stack_1", "upconv/strided_slice/stack_1"]}, {"attr": {"T": {"type": "DT_INT32"}}, "op": "Mul", "name": "upconv/mul_1", "input": ["upconv/strided_slice_2", "upconv/mul/y"]}, {"attr": {"T": {"type": "DT_INT32"}}, "op": "Mul", "name": "upconv/mul", "input": ["upconv/strided_slice_1", "upconv/mul/y"]}, {"attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}, "op": "Pack", "name": "upconv/conv2d_transpose/output_shape", "input": ["upconv/strided_slice", "upconv/mul", "upconv/mul_1", "upconv/conv2d_transpose/output_shape/3"]}, {"attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}, "op": "Conv2DBackpropInput", "name": "upconv/conv2d_transpose", "input": ["upconv/conv2d_transpose/output_shape", "upconv/conv2d_transpose_filter", "leaky_relu_5"]}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Minimum", "name": "output/Minimum", "input": ["upconv/conv2d_transpose", "output/Minimum/y"]}, {"attr": {"T": {"type": "DT_FLOAT"}}, "op": "Maximum", "name": "output", "input": ["output/Minimum", "output/y"]}, {"attr": {"T": {"list": {"type": ["DT_FLOAT"]}}}, "op": "Identity", "name": "Identity", "input": ["output"]}], "library": {}}, "generatedBy": "2.0.0-dev20190322", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "graph-model", "weightsManifest": [{"weights": [{"name": "output/y", "shape": [], "dtype": "float32"}, {"name": "output/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "conv2d_bias_5/bias_value", "shape": [256], "dtype": "float32"}, {"name": "conv2d_bias_5/conv2d_filter", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_bias_4/bias_value", "shape": [128], "dtype": "float32"}, {"name": "conv2d_bias_4/conv2d_filter", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_bias_3/bias_value", "shape": [128], "dtype": "float32"}, {"name": "conv2d_bias_3/conv2d_filter", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_bias_2/bias_value", "shape": [64], "dtype": "float32"}, {"name": "conv2d_bias_2/conv2d_filter", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_bias_1/bias_value", "shape": [32], "dtype": "float32"}, {"name": "conv2d_bias_1/conv2d_filter", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_bias_0/bias_value", "shape": [16], "dtype": "float32"}, {"name": "conv2d_bias_0/conv2d_filter", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "upconv/conv2d_transpose_filter", "shape": [4, 4, 3, 256], "dtype": "float32"}, {"name": "upconv/conv2d_transpose/output_shape/3", "shape": [], "dtype": "int32"}, {"name": "upconv/mul/y", "shape": [], "dtype": "int32"}, {"name": "upconv/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "upconv/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "upconv/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "upconv/strided_slice/stack", "shape": [1], "dtype": "int32"}], "paths": ["group1-shard1of1.bin"]}]}